--测试用的数据
exec intb 'tbCell', '三门峡','124672-0',	'三门峡渑池刘果-HLHF-','124872','三门峡渑池刘果-HLHF','38400','32','2','10','14531','华为','111.7707','34.81039','宏站','30','43','6','2','8'
EXEC intb 'tbMROData', '2016-07-19T10:00:03,840',	'5641-129',	'15513-128',	'54',	'40',	'38400',	'499'
exec intb 'tbKPI','07/17/2016 00:00:00','	1440',	'三门峡连霍义马高速西-HLHF',	'eNodeB名称=三门峡连霍义马高速西-HLHF, 本地小区标识=0, 小区名称=三门峡连霍义马高速西-HLHF-1, eNodeB标识=5682, 小区双工模式=CELL_TDD',	'三门峡连霍义马高速西-HLHF-1',	'22915',	'22951',	'0.998',	'21644',	'21652',	'1',	'25',	'0',	'0.001',	'0.999',	'0',	'24',	'21129',	'0.001',	'0',	'0',	'0',	'0',	'0'	,'0',	'20218',	'20226',	'0',	'0.999',	'0.999',	'0',	'0.999',	'2359923920',	'16197729064',	'138',	'0.006',	'5',	'0',	'0',	'0',	'0',	'0'
EXEC intb 'tbPRB','07/17/2016 00:00:00',	'15',	'三门峡义马高速入口-HLHF',	'eNodeB名称=三门峡义马高速入口-HLHF, 本地小区标识=2, 小区名称=三门峡义马高速入口-HLHF-3, eNodeB标识=253896, 小区双工模式=CELL_TDD',	'三门峡义马高速入口-HLHF-3',	'-107','-116',	'-116',	'-117','	-116',	'-117',	'-116',	'-117',	'-117',	'-117','	-117',	'-117',	'-117',	'-117',	'-115',	'-115',	'-115','	-115',	'-116',	'-116',	'-117','	-117',	'-117','	-117',	'-117',	'-117',	'-117',	'-117',	'-117',	'-117',	'-117',	'-117',	'-117',	'-117',	'-117',	'-117',	'-117',	'-117',	'-117',	'-117',	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-116,	-116,	-116,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-116,	-116,	-116,	-116,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-117,	-116,	-117,	-117



--根据小区号或小区名查
CREATE proc [dbo].[cellProc]
@cname nvarchar(100),
@cid   nvarchar(100)
as
begin
select * from tbcell where SECTOR_NAME=@cname or SECTOR_ID=@cid
end



--根据基站名基站号查
create proc [dbo].[enodeProc]
@ename nvarchar(100),
@eid   int
as
begin
select * from tbcell where ENODEB_NAME=@ename or ENODEBID=@eid
end



--选定表tbKPI中的某个特定网元，显示其属性列表
create PROCEDURE [dbo].[KPI1]
@NAME NVARCHAR(100)
AS
BEGIN
SELECT * FROM tbKPI WHERE 网元名称=@NAME	
END



--时间段内的某个属性
create PROCEDURE [dbo].[KPI2]
@NAME NVARCHAR(100),
@sDATE NVARCHAR(100),
@eDATE NVARCHAR(100),
@ATTR NVARCHAR(255)
AS
BEGIN
declare @sql nvarchar(300)
--SELECT* FROM tbKPI WHERE (起始时间 BETWEEN @sDATE AND @eDATE) AND 网元名称=@NAME
set @sql='SELECT'+@ATTR+' FROM tbKPI WHERE 网元名称='''+@NAME+'''and(起始时间 BETWEEN '''+@sDATE+'''AND'''+@eDATE+''')'
print @sql
exec(@sql)
end
